Documents/МедицинскийОсмотр.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Document>
		<Properties>
			<Name>МедицинскийОсмотр</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.РезультатыМедицинскихОсмотров</xr:Item>
				<xr:Item>AccumulationRegister.РасходыНаСотрудниковОрганизации</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидМедосмотра</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыМедицинскихОсмотров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Работники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатОсмотра</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыРезультатовМедицинскогоОсмотра</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеРезультата</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаСледующегоОсмотра</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРасходов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>КонтактнаяИнформация</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле4</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле5</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле6</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле7</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле8</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле9</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле10</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле11</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле12</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле13</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.MGS_Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.СлужбыПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОтветственныеЛицаОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>ОтветственныеЛицаОрганизаций</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.MGS_ПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.ТабеляУчетаОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.MGS_Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОтветственноеЛицо</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ОтветственныеЛицаОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ОтветственныеЛицаОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>ОтветственныеЛицаОрганизаций</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Руководитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлавныйБухгалтер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РуководительКадровойСлужбы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кассир</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветственныйЗаНалоговыеРегистры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УполномоченныйПредставитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИндивидуальныйПредприниматель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исполнитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Табельщик</Name>
					<Comment>vvv</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредседательПрофкома</Name>
					<Comment>vvv</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыРезультатовМедицинскогоОсмотра.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>ВидыРезультатовМедицинскогоОсмотра</Name>
			<Comment>vvv</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Годен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеГоден</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/МедицинскийОсмотр/Ext/ManagerModule.bsl
////////////////////////////////////////////////////////////////////////////////
// Процедуры печати документа.

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт	
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ДопущениеКРаботе") Тогда
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ДопущениеКРаботе", "Приказ о допущении к работе", ПриказОДопущении(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ОтстранениеОтРаботы") Тогда
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ОтстранениеОтРаботы", "Приказ об отстранении от работы", ПриказОбОтстранении(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
	
КонецПроцедуры	

Функция ПриказОДопущении(ДокументСсылка, ОбъектыПечати)
	
	ДокументРезультат = Новый ТабличныйДокумент;

	Макет = Документы.МедицинскийОсмотр.ПолучитьМакет("ДопущениеКРаботе");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Документ", ДокументСсылка);
	Запрос.УстановитьПараметр("ДатаСреза", ДокументСсылка.Дата);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница",ДокументСсылка.Организация);
		
	Запрос.Текст = ФормированиеПечатныхФормЗК.ПолучитьТекстЗапросаПоОтветственнымЛицам(
		"ДатаСреза",
		"ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.Руководитель)
		|И СтруктурнаяЕдиница = &СтруктурнаяЕдиница");
	Запрос.Выполнить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МедицинскийОсмотр.Организация.НаименованиеПолное КАК НаименованиеОрганизации,
	|	МедицинскийОсмотр.Номер КАК КодДокумента,
	|	МедицинскийОсмотр.Дата,
	|	МедицинскийОсмотр.Номер,
	|	ЕСТЬNULL(ФИОФизЛиц.Фамилия, """") КАК Фамилия,
	|	ЕСТЬNULL(ФИОФизЛиц.Имя, """") КАК Имя,
	|	ЕСТЬNULL(ФИОФизЛиц.Отчество, """") КАК Отчество,
	|	ВЫБОР
	|		КОГДА РаботникиОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	|				И РаботникиОрганизаций.ПериодЗавершения < &ДатаСреза
	|			ТОГДА ЕСТЬNULL(РаботникиОрганизаций.ДолжностьЗавершения.Наименование, """")
	|		ИНАЧЕ ЕСТЬNULL(РаботникиОрганизаций.Должность.Наименование, """")
	|	КОНЕЦ КАК ДолжностьСотрудника,
	|	ЕСТЬNULL(КонтактнаяИнформация.Поле4, """") КАК Поле3,
	|	ЕСТЬNULL(КонтактнаяИнформация.Поле2, """") КАК Поле1,
	|	ОтветственныеЛицаОрганизаций.Должность КАК ДолжностьРуководителя,
	|	ОтветственныеЛицаОрганизаций.НаименованиеОтветственногоЛица КАК ФИОРуководителя,
	|	МедицинскийОсмотр.Ссылка КАК Медосмотр,
	|	РаботникиДокумента.ФизЛицо КАК РаботникФизЛицо,
	|	РаботникиДокумента.ФизЛицо.Пол КАК Пол,
	|	РаботникиДокумента.Сотрудник
	|ИЗ
	|	Документ.МедицинскийОсмотр КАК МедицинскийОсмотр
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ПО МедицинскийОсмотр.Организация = КонтактнаяИнформация.Объект
	|			И (КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|			И (КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресОрганизации))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.МедицинскийОсмотр.Работники КАК РаботникиДокумента
	|		ПО МедицинскийОсмотр.Ссылка = РаботникиДокумента.Ссылка
	|			И (РаботникиДокумента.РезультатОсмотра = ЗНАЧЕНИЕ(Перечисление.ВидыРезультатовМедицинскогоОсмотра.Годен))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаСреза, ) КАК ФИОФизЛиц
	|		ПО (ФИОФизЛиц.ФизЛицо = РаботникиДокумента.Сотрудник.Физлицо)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаСреза, ) КАК РаботникиОрганизаций
	|		ПО (РаботникиОрганизаций.Организация = МедицинскийОсмотр.Организация)
	|			И (РаботникиОрганизаций.Сотрудник = РаботникиДокумента.Сотрудник)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеОбОтветственномЛице КАК ОтветственныеЛицаОрганизаций
	|		ПО МедицинскийОсмотр.Организация = ОтветственныеЛицаОрганизаций.СтруктурнаяЕдиница
	|ГДЕ
	|	МедицинскийОсмотр.Ссылка = &Документ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Медосмотр,
	|	РаботникиДокумента.НомерСтроки";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.СледующийПоЗначениюПоля("Медосмотр") Цикл
		ОбластьШапка.Параметры.НаименованиеОрганизации = Выборка.НаименованиеОрганизации;
		ОбластьШапка.Параметры.ДатаДокумента = Формат(Выборка.Дата, "ДЛФ=ДД");
		Город = ?(ЗначениеЗаполнено(Выборка.Поле3), Выборка.Поле3, Выборка.Поле1);
		Если Прав(Город, 2) = " г" Тогда
			Город = "г. " + Лев(Город, СтрДлина(Город)-2);
		КонецЕсли;
		ОбластьШапка.Параметры.Город = Город;
		ОбластьШапка.Параметры.НомерПриказа = Выборка.Номер;
		ДокументРезультат.Вывести(ОбластьШапка);
		НомерСтроки = 0;
		
		Пока Выборка.Следующий() Цикл
			
			Если ЗначениеЗаполнено(Выборка.Сотрудник) Тогда
				НомерСтроки = НомерСтроки + 1;
				
				Фамилия = Выборка.Фамилия;
				УниверсальныеМеханизмы.Просклонять(глЗначениеПеременной("глКомпонентаСклоненияФИО"), Фамилия, 4, Выборка.Пол, Фамилия);
				Имя = Выборка.Имя;
				Отчество = Выборка.Отчество;
				ФИОСокращенно = ?(НЕ ПустаяСтрока(Фамилия), 
				Фамилия + ?(НЕ ПустаяСтрока(Имя)," " + Лев(Имя,1) + "." + ?(НЕ ПустаяСтрока(Отчество),Лев(Отчество,1)+".", ""), ""),
				"");
				ОбластьСтрока.Параметры.ФИОДолжностьСотрудника = ФИОСокращенно + ?(НЕ ПустаяСтрока(Выборка.ДолжностьСотрудника),  " (" + Выборка.ДолжностьСотрудника + ")", "");
				ОбластьСтрока.Параметры.НомерСтроки = НомерСтроки;
				ДокументРезультат.Вывести(ОбластьСтрока);
			КонецЕсли;
		КонецЦикла;
		
		ОбластьПодвал.Параметры.Основания = "Медицинский осмотр " + Выборка.КодДокумента + " от " + Формат(Выборка.Дата, "ДЛФ=ДД");
		ОбластьПодвал.Параметры.ФИОДиректора = Выборка.ФИОРуководителя;
		ОбластьПодвал.Параметры.ДолжностьРук = Выборка.ДолжностьРуководителя;
		
		ДокументРезультат.Вывести(ОбластьПодвал);
		
	КонецЦикла;
	
	Возврат ДокументРезультат;	
	
КонецФункции //ПечатьПриказаОДопущении()

Функция ПриказОбОтстранении(ДокументСсылка, ОбъектыПечати)
	
	ДокументРезультат = Новый ТабличныйДокумент;

	Макет = Документы.МедицинскийОсмотр.ПолучитьМакет("ОтстранениеОтРаботы");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Документ", ДокументСсылка);
	Запрос.УстановитьПараметр("ДатаСреза", ДокументСсылка.Дата);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница",ДокументСсылка.Организация);
		
	Запрос.Текст = ФормированиеПечатныхФормЗК.ПолучитьТекстЗапросаПоОтветственнымЛицам(
		"ДатаСреза",
		"ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.Руководитель)
		|И СтруктурнаяЕдиница = &СтруктурнаяЕдиница");
	Запрос.Выполнить();
	
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	МедицинскийОсмотр.Организация.НаименованиеПолное КАК НаименованиеОрганизации,
	               |	МедицинскийОсмотр.Номер КАК КодДокумента,
	               |	МедицинскийОсмотр.Дата,
	               |	МедицинскийОсмотр.Номер,
	               |	ЕСТЬNULL(ФИОФизЛиц.Фамилия, """") КАК Фамилия,
	               |	ЕСТЬNULL(ФИОФизЛиц.Имя, """") КАК Имя,
	               |	ЕСТЬNULL(ФИОФизЛиц.Отчество, """") КАК Отчество,
	               |	ВЫБОР
	               |		КОГДА РаботникиОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	               |				И РаботникиОрганизаций.ПериодЗавершения < &ДатаСреза
	               |			ТОГДА ЕСТЬNULL(РаботникиОрганизаций.ДолжностьЗавершения.Наименование, """")
	               |		ИНАЧЕ ЕСТЬNULL(РаботникиОрганизаций.Должность.Наименование, """")
	               |	КОНЕЦ КАК ДолжностьСотрудника,
	               |	ЕСТЬNULL(КонтактнаяИнформация.Поле4, """") КАК Поле3,
	               |	ЕСТЬNULL(КонтактнаяИнформация.Поле2, """") КАК Поле1,
	               |	ОтветственныеЛицаОрганизаций.Должность КАК ДолжностьРуководителя,
	               |	ОтветственныеЛицаОрганизаций.НаименованиеОтветственногоЛица КАК ФИОРуководителя,
	               |	ЕСТЬNULL(ФИОБухгалтера.Фамилия, """") КАК ФамилияБухгалтера,
	               |	ЕСТЬNULL(ФИОБухгалтера.Имя, """") КАК ИмяБухгалтера,
	               |	ЕСТЬNULL(ФИОБухгалтера.Отчество, """") КАК ОтчествоБухгалтера,
	               |	ЕСТЬNULL(ФИОКадровика.Фамилия, """") КАК ФамилияКадровика,
	               |	ЕСТЬNULL(ФИОКадровика.Имя, """") КАК ИмяКадровика,
	               |	ЕСТЬNULL(ФИОКадровика.Отчество, """") КАК ОтчествоКадровика,
	               |	ЕСТЬNULL(МедицинскийОсмотр.ВидМедосмотра, """") КАК ВидДопуска,
	               |	МедицинскийОсмотр.Ссылка КАК Медосмотр,
	               |	РаботникиДокумента.Сотрудник,
	               |	РаботникиДокумента.ФизЛицо.Пол КАК Пол
	               |ИЗ
	               |	Документ.МедицинскийОсмотр КАК МедицинскийОсмотр
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	               |		ПО МедицинскийОсмотр.Организация = КонтактнаяИнформация.Объект
	               |			И (КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	               |			И (КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресОрганизации))
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.МедицинскийОсмотр.Работники КАК РаботникиДокумента
	               |		ПО МедицинскийОсмотр.Ссылка = РаботникиДокумента.Ссылка
	               |			И (РаботникиДокумента.РезультатОсмотра = ЗНАЧЕНИЕ(Перечисление.ВидыРезультатовМедицинскогоОсмотра.НЕГоден))
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаСреза, ) КАК ФИОФизЛиц
	               |		ПО (ФИОФизЛиц.ФизЛицо = РаботникиДокумента.Сотрудник.Физлицо)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаСреза, ) КАК РаботникиОрганизаций
	               |		ПО (РаботникиОрганизаций.Организация = МедицинскийОсмотр.Организация)
	               |			И (РаботникиОрганизаций.Сотрудник = РаботникиДокумента.Сотрудник)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеОбОтветственномЛице КАК ОтветственныеЛицаОрганизаций
	               |		ПО МедицинскийОсмотр.Организация = ОтветственныеЛицаОрганизаций.СтруктурнаяЕдиница
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(&ДатаСреза, ) КАК ОтветственныеЛицаБухгалтер
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаСреза, ) КАК ФИОБухгалтера
	               |			ПО ОтветственныеЛицаБухгалтер.ФизическоеЛицо = ФИОБухгалтера.ФизЛицо
	               |		ПО МедицинскийОсмотр.Организация = ОтветственныеЛицаБухгалтер.СтруктурнаяЕдиница
	               |			И (ОтветственныеЛицаБухгалтер.ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер))
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(&ДатаСреза, ) КАК ОтветственныеЛицаКадровик
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаСреза, ) КАК ФИОКадровика
	               |			ПО ОтветственныеЛицаКадровик.ФизическоеЛицо = ФИОКадровика.ФизЛицо
	               |		ПО МедицинскийОсмотр.Организация = ОтветственныеЛицаКадровик.СтруктурнаяЕдиница
	               |			И (ОтветственныеЛицаКадровик.ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.РуководительКадровойСлужбы))
	               |ГДЕ
	               |	МедицинскийОсмотр.Ссылка = &Документ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Медосмотр,
	               |	РаботникиДокумента.НомерСтроки";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.СледующийПоЗначениюПоля("Медосмотр") Цикл
		ОбластьШапка.Параметры.НаименованиеОрганизации = Выборка.НаименованиеОрганизации;
		ОбластьШапка.Параметры.ДатаДокумента = Формат(Выборка.Дата, "ДЛФ=ДД");
		Город = ?(ЗначениеЗаполнено(Выборка.Поле3), Выборка.Поле3, Выборка.Поле1);
		Если Прав(Город, 2) = " г" Тогда
			Город = "г. " + Лев(Город, СтрДлина(Город)-2);
		КонецЕсли;
		ОбластьШапка.Параметры.Город = Город;
		ОбластьШапка.Параметры.НомерПриказа = Выборка.Номер;
		
		ДокументРезультат.Вывести(ОбластьШапка);
		
		НомерСтроки = 0;
		
		Пока Выборка.Следующий() Цикл
			Если ЗначениеЗаполнено(Выборка.Сотрудник) Тогда
				НомерСтроки = НомерСтроки + 1;
				
				Фамилия = Выборка.Фамилия;
				УниверсальныеМеханизмы.Просклонять(глЗначениеПеременной("глКомпонентаСклоненияФИО"), Фамилия, 4, Выборка.Пол, Фамилия);
				Имя = Выборка.Имя;
				Отчество = Выборка.Отчество;
				ФИОСокращенно = ?(НЕ ПустаяСтрока(Фамилия), 
				Фамилия + ?(НЕ ПустаяСтрока(Имя)," " + Лев(Имя,1) + "." + ?(НЕ ПустаяСтрока(Отчество),Лев(Отчество,1)+".", ""), ""),
				"");
				ОбластьСтрока.Параметры.ФИОДолжностьСотрудника = ФИОСокращенно + ?(НЕ ПустаяСтрока(Выборка.ДолжностьСотрудника),  " (" + Выборка.ДолжностьСотрудника + ")", "");
				ОбластьСтрока.Параметры.НомерСтроки = НомерСтроки;
				ДокументРезультат.Вывести(ОбластьСтрока);
			КонецЕсли;
		КонецЦикла;
		
		ОбластьПодвал.Параметры.Основания = "Медицинский осмотр " + Выборка.КодДокумента + " от " + Формат(Выборка.Дата, "ДЛФ=ДД");
		ОбластьПодвал.Параметры.ФИОДиректора = Выборка.ФИОРуководителя;
		ОбластьПодвал.Параметры.ДолжностьРук = Выборка.ДолжностьРуководителя;
		ОбластьПодвал.Параметры.ФИОНачальникаОтделаКадров = ?(ЗначениеЗаполнено( Выборка.ФамилияКадровика), Лев(Выборка.ИмяКадровика, 1) + ". " + Лев(Выборка.ОтчествоКадровика, 1) + ". " + Выборка.ФамилияКадровика, "");
		ОбластьПодвал.Параметры.ФИОГлавногоБухгалтера = ?(ЗначениеЗаполнено(Выборка.ФамилияБухгалтера), Лев(Выборка.ИмяБухгалтера, 1) + ". " + Лев(Выборка.ОтчествоБухгалтера, 1) + ". " + Выборка.ФамилияБухгалтера, "");
		
		ДокументРезультат.Вывести(ОбластьПодвал);
	КонецЦикла;	
	
	Возврат ДокументРезультат;
	
КонецФункции //ПечатьПриказаОбОтстранении()
